Белгипрозем_2017/src/Documents/мВнесениеДатыРешения/мВнесениеДатыРешения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мВнесениеДатыРешения</name>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>CatalogRef.ВходящиеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРешения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Сроки</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ВнутренниеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/InformationRegisters/мДатыДоговоров/мДатыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мДатыДоговоров</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИзмОснование</name>
    <comment>Промежуточный</comment>
    <type>
      <types>DocumentRef.ИзменениеДатДоговоров</types>
      <types>DocumentRef.ВедомостьАктирования</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>DocumentRef.ОплатаРабот</types>
      <types>DocumentRef.РеестрТекущихПлатежей</types>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Установил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДатыДоговора</name>
    <type>
      <types>CatalogRef.мВидыДатДоговоров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef.мВнесениеДатыРешения</types>
      <types>DocumentRef.ИзменениеДатДоговоров</types>
      <types>DocumentRef.мАктирование</types>
      <types>DocumentRef.ВедомостьАктирования</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>DocumentRef.ОплатаРабот</types>
      <types>DocumentRef.мВзаимозачет</types>
      <types>DocumentRef.мПродлениеСроков</types>
      <types>DocumentRef.РеестрТекущихПлатежей</types>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Catalogs/ТипыСвязей/ТипыСвязей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыСвязей</name>
  <predefined>
    <items>
      <name>ВходитВКомплект</name>
      <description>Входит в комплект</description>
    </items>
    <items>
      <name>ДелаетНеДействующим</name>
      <description>Делает не действующим</description>
    </items>
    <items>
      <name>ДелоВАрхиве</name>
      <description>Дело в архиве</description>
    </items>
    <items>
      <name>Имеет</name>
      <description>Имеет акты/доп.согл, и т.д.</description>
    </items>
    <items>
      <name>НаОснованииПисьма</name>
      <description>На основании письма</description>
    </items>
    <items>
      <name>НаОснованииПоручения</name>
      <description>На основании поручения</description>
    </items>
    <items>
      <name>НеДействуетВСоответствии</name>
      <description>Не действует в соответствии</description>
    </items>
    <items>
      <name>ОтноситсяК</name>
      <description>Относится к</description>
    </items>
    <items>
      <name>ОтноситсяКДоговору</name>
      <description>Относится к договору</description>
    </items>
    <items>
      <name>ОтноситсяКПоручению</name>
      <description>Относится к поручению</description>
    </items>
    <items>
      <name>ОтправилоДокумент</name>
      <description>Отправило документ</description>
    </items>
    <items>
      <name>ОтправленВОтветНа</name>
      <description>Отправлен в ответ на</description>
    </items>
    <items>
      <name>ОтправленВОтветНаНесколько</name>
      <description>Отправлен в ответ на несколько</description>
    </items>
    <items>
      <name>ВОтветНаПереадресованное</name>
      <description>Отправлен в ответ на переадресованное</description>
    </items>
    <items>
      <name>ОтправленВОтветНаПисьмо</name>
      <description>Отправлен в ответ на письмо</description>
    </items>
    <items>
      <name>ОтправленОтвет</name>
      <description>Отправлен ответ</description>
    </items>
    <items>
      <name>ОтветПереадресовавшему</name>
      <description>Отправлен ответ переадресовавшему</description>
    </items>
    <items>
      <name>ОтправленОтветныйДокумент</name>
      <description>Отправлен ответный документ</description>
    </items>
    <items>
      <name>ОтправленСообщениемСВД</name>
      <description>Отправлен сообщением СВД</description>
    </items>
    <items>
      <name>ОтправленоОтветноеПисьмо</name>
      <description>Отправлено ответное письмо</description>
    </items>
    <items>
      <name>ПереадресацияДокумента</name>
      <description>Переадресация документа</description>
    </items>
    <items>
      <name>ПереадресованДокументом</name>
      <description>Переадресован документом</description>
    </items>
    <items>
      <name>ПерепискаПоДоговору</name>
      <description>Переписка по договору</description>
    </items>
    <items>
      <name>ПерепискаПоПредмету</name>
      <description>Переписка по предмету</description>
    </items>
    <items>
      <name>ПересланоПисьмом</name>
      <description>Переслано письмом</description>
    </items>
    <items>
      <name>ПересылкаПисьма</name>
      <description>Пересылка письма</description>
    </items>
    <items>
      <name>ПисьмоОтправленоВОтветНа</name>
      <description>Письмо отправлено в ответ на</description>
    </items>
    <items>
      <name>ПисьмоОснование</name>
      <description>Письмо-основание</description>
    </items>
    <items>
      <name>ПолученВОтветНа</name>
      <description>Получен в ответ на</description>
    </items>
    <items>
      <name>ПолученВОтветНаПисьмо</name>
      <description>Получен в ответ на письмо</description>
    </items>
    <items>
      <name>ПолученОтвет</name>
      <description>Получен ответ</description>
    </items>
    <items>
      <name>ПолученОтветныйДокумент</name>
      <description>Получен ответный документ</description>
    </items>
    <items>
      <name>ПолученоВОтветНаДокумент</name>
      <description>Получено в ответ на документ</description>
    </items>
    <items>
      <name>ПолученоВОтветНаПисьмо</name>
      <description>Получено в ответ на письмо</description>
    </items>
    <items>
      <name>ПолученоОтветноеПисьмо</name>
      <description>Получено ответное письмо</description>
    </items>
    <items>
      <name>Поручение</name>
      <description>Поручение</description>
    </items>
    <items>
      <name>ПоручениеСодержит</name>
      <description>Поручение содержит</description>
    </items>
    <items>
      <name>Содержит</name>
      <description>Содержит</description>
    </items>
    <items>
      <name>ПредметПереписки</name>
      <description>Содержит переписку по</description>
    </items>
    <items>
      <name>ДоговорПереписки</name>
      <description>Содержит переписку по договору</description>
    </items>
    <items>
      <name>СоздалоДокумент</name>
      <description>Создало документ</description>
    </items>
    <items>
      <name>СозданИзСообщенияСВД</name>
      <description>Создан из сообщения СВД</description>
    </items>
    <items>
      <name>СписанВ</name>
      <description>Списан в</description>
    </items>
    <items>
      <name>ОсновноеОбращение</name>
      <description>Является дубликатом для</description>
    </items>
    <items>
      <name>Дубликат</name>
      <description>Является основным для</description>
    </items>
    <items>
      <name>ПовторноеОбращение</name>
      <description>Является первичным для</description>
    </items>
    <items>
      <name>ПервичноеОбращение</name>
      <description>Является повторным для</description>
    </items>
    <items>
      <name>ОтноситсяКОбращению</name>
      <description>Относится к обращению</description>
    </items>
    <items>
      <name>ОтправленоУведомление</name>
      <description>Отправлено уведомление</description>
    </items>
    <items>
      <name>ПеренаправлениеПисьма</name>
      <description>Перенаправление письма</description>
    </items>
    <items>
      <name>ПеренаправленоПисьмом</name>
      <description>Перенаправлено письмом</description>
    </items>
    <items>
      <name>ПерепискаПоОбращению</name>
      <description>Переписка по обращению</description>
    </items>
    <items>
      <name>СодержитСсылкуНаИнтегрированныйОбъект</name>
      <description>Содержит ссылку на</description>
    </items>
    <items>
      <name>УведомлениеПоОбращению</name>
      <description>Уведомление по обращению</description>
    </items>
    <items>
      <name>ПовторноеИсходящее</name>
      <description>Является первичным для исходящего</description>
    </items>
    <items>
      <name>ПовторноеЗаявление</name>
      <description>Является первичным заявлением для</description>
    </items>
    <items>
      <name>ПервичноеИсходящее</name>
      <description>Является повторным для исходящего</description>
    </items>
    <items>
      <name>ПервичноеЗаявление</name>
      <description>Является повторным заявлением для</description>
    </items>
  </predefined>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

Белгипрозем_2017/src/Catalogs/мВидыДатДоговоров/мВидыДатДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мВидыДатДоговоров</name>
  <predefined>
    <items>
      <name>ДатаВозвратаДоговора</name>
      <description>Дата возврата договора</description>
    </items>
    <items>
      <name>ДатаВозобновленияРабот</name>
      <description>Дата возобновления работ</description>
    </items>
    <items>
      <name>ДатаВыполнения</name>
      <description>Дата выполнения</description>
    </items>
    <items>
      <name>ДатаЗакрытия</name>
      <description>Дата закрытия</description>
    </items>
    <items>
      <name>ДатаОплаты</name>
      <description>Дата оплаты</description>
    </items>
    <items>
      <name>ДатаПодписанияЗаказчиком</name>
      <description>Дата подписания заказчиком</description>
    </items>
    <items>
      <name>ДатаПредоставленияДокументов</name>
      <description>Дата предоставления документов</description>
    </items>
    <items>
      <name>ДатаПриостановленияРабот</name>
      <description>Дата приостановления работ</description>
    </items>
    <items>
      <name>ДатаПродления</name>
      <description>Дата продления</description>
    </items>
    <items>
      <name>ДатаРегистрации</name>
      <description>Дата регистрации</description>
    </items>
    <items>
      <name>ПлановыйСрок</name>
      <description>Плановый срок</description>
    </items>
  </predefined>
</mdclass:Catalog>

Белгипрозем_2017/src/Documents/мВнесениеДатыРешения/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	ПроведениеСервер.УстановитьРежимПроведения(Проведен, РежимЗаписи, РежимПроведения);
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	Документы.мВнесениеДатыРешения.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ТаблицаСроки = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСроки;

	МассивЭтапов = Новый Массив;
	Установил = Неопределено;
	
	// Запись даты решения в этап
	Для каждого Стр Из ТаблицаСроки Цикл
		
		МассивЭтапов.Добавить(Стр.ЭтапДоговора);
		Установил = Стр.Ответственный;
		
		Попытка
			Этап = Стр.ЭтапДоговора.ПолучитьОбъект();
			Этап.ДатаПредоставленияРешения = Стр.ДатаРешения;
			Этап.Записать();
		Исключение
			Сообщить("Дата решения не записалась в этап "+Стр.ЭтапДоговора+" "+Стр.Договор);
			Отказ = Истина;
		КонецПопытки; 
		
		// Установка связи
		Если ЗначениеЗаполнено(Ссылка.Решение) Тогда
	        СвязиДокументов.УстановитьСвязь(Ссылка.Решение, Неопределено, Стр.Договор, Справочники.ТипыСвязей.ПредметПереписки);
		КонецЕсли; 
	КонецЦикла;
	
	// Расчет и запись плановых сроков
	ПлановыеСрокиЭтапов = мРаботаСДоговорами.РассчитатьПлановыеСрокиЭтапов(МассивЭтапов);
	
	ВидДатыДоговора = Справочники.мВидыДатДоговоров.ПлановыйСрок;
	
	НаборЗаписей = РегистрыСведений.мДатыДоговоров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Основание.Установить(Ссылка);
	
	Для каждого Стр Из ПлановыеСрокиЭтапов Цикл
		НовЗап = НаборЗаписей.Добавить();
		НовЗап.Период = Ссылка.Дата;
		НовЗап.ЭтапДоговора = Стр.ЭтапДоговора;
		НовЗап.ВидДатыДоговора = ВидДатыДоговора;
		НовЗап.Основание = Ссылка;
		НовЗап.Дата = Стр.ПлановыйСрок;
		НовЗап.Комментарий = ""+Ссылка.Решение.РегистрационныйНомер + " от " + Формат(Ссылка.Решение.ДатаРегистрации, "ДФ=dd.MM.yy");
		НовЗап.Установил = Установил;
	КонецЦикла; 
	
	НаборЗаписей.Записать();
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры  

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПустаяДата = Дата(1, 1, 1);
	
	// Очистка даты решения в этапах
	Для каждого Стр Из Ссылка.Сроки Цикл
		
		Попытка
			Этап = Стр.ЭтапДоговора.ПолучитьОбъект();
			Этап.ДатаПредоставленияРешения = ПустаяДата;
			Этап.Записать();
		Исключение
			Сообщить("Дата решения не удалена в этапе "+Стр.ЭтапДоговора+" "+Стр.Договор);
			Отказ = Истина;
		КонецПопытки; 
		
		// Разрыв связи
		Если ЗначениеЗаполнено(Ссылка.Решение) Тогда
	        СвязиДокументов.УдалитьСвязь(Ссылка.Решение, Стр.Договор, Справочники.ТипыСвязей.ПерепискаПоПредмету);
		КонецЕсли; 
	КонецЦикла;
	
	// Удаление плановых сроков
	НаборЗаписей = РегистрыСведений.мДатыДоговоров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Основание.Установить(Ссылка);
	НаборЗаписей.Записать();
КонецПроцедуры
